tap "sdkman/tap"
# User-friendly launcher for Bazel
brew "bazelisk" # v1.27.0
# Load/unload environment variables based on $PWD
brew "direnv" # v2.37.1
# Pack, ship and run any application as a lightweight container
brew "docker" # v29.1.3
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli" # v0.22.2
# GitHub command-line tool
brew "gh" # v2.83.2
# Distributed revision control system
brew "git" # v2.52.0
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle" # v9.2.1
# Java-based scripting language
brew "groovy" # v5.0.3
# Lightweight and flexible command-line JSON processor
brew "jq" # v1.8.1
# Development kit for the Java programming language
brew "openjdk@17" # v17.0.17
# Cross-shell prompt for astronauts
brew "starship" # v1.24.1
# Display directories as trees (with optional color/HTML output)
brew "tree" # v2.2.1
# Internet file retriever
brew "wget" # v1.25.0
# SDKMAN! the Software Development Kit Manager
brew "sdkman/tap/sdkman-cli" # v5.19.0
# AI Coding Agent IDE
cask "antigravity" # v1.13.3,4533425205018624
# Display management tool
cask "betterdisplay" # v4.1.1
# Anthropic's official Claude AI desktop app
cask "claude" # v0.14.10,fe3f5688c1c2a4b648d1bf6d9784d62ef9fc336a
# Terminal-based AI coding assistant
cask "claude-code" # v2.0.76
# OpenAI's coding agent that runs in your terminal
cask "codex" # v0.77.0
cask "font-fira-code" # v6.2
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty" # v1.2.3
# Web browser
cask "google-chrome" # v143.0.7499.170
# Software for Logitech devices
cask "logi-options+" # v1.98.809639
# VPN client focusing on security
cask "protonvpn" # v6.2.0
# Open-source code editor
cask "visual-studio-code" # v1.107.1
